* Операции git
** Добавлние удаленных репозиториев
#+BEGIN_SRC bash :results none
git remote remove github.com
git remote add github.com git@github.com:mnasoft/mnas-package.git

git remote remove common-lisp.net
git remote add common-lisp.net git@common-lisp.net:nmatvyeyev/mnas-package.git

git remote remove gitlab.com
git remote add gitlab.com git@gitlab.com:mnas/mnas-package.git

#+END_SRC
** Перечень удаленных репозиториев
 #+BEGIN_SRC bash 
 git remote
 #+END_SRC

 #+RESULTS:
 | KO11-118383     |
 | MNASOFT-01      |
 | MNASOFT-10      |
 | N118389         |
 | common-lisp.net |
 | github.com      |
 | gitlab.com      |
 | hp1.zorya.com   |
 | mnasoft-00      |
 | mnasoft-dev     |
 | mnasoft-pi      |

** Коммит изменений
 #+BEGIN_SRC bash :results none
 DATE=`date`
 git commit -a -m "$DATE"
 #+END_SRC

** Получение изменений с удаленных серверов
 #+BEGIN_SRC bash :results none
 for i in github.com gitlab.com common-lisp.net 
 do
 git pull ${i} master
 done
 #+END_SRC

** Публикация изменений на удаленных серверах
 #+BEGIN_SRC bash :results none
 for i in github.com gitlab.com common-lisp.net 
 do
 git push ${i} master
 done
 #+END_SRC

